{
  "nodes": [
    {
      "key": "1",
      "attributes": {
        "size": 25,
        "label": "Веб",
        "text": "Веб или вэб (англ. web — паутина) — интернет-пространство. система доступа к связанным между собой документам на различных компьютерах, подключённых к Интернету."
      }
    },
    {
      "key": "2",
      "attributes": {
        "size": 15,
        "label": "Веб-технологии",
        "text": "Под «веб-технологиями» обычно подразумеваются языки разметки, языки программирования, базы данных, системы и платформы CMS и другие технологии, которые позволяют создавать веб-сайты, приложения и магазины."
      }
    },
    {
      "key": "3",
      "attributes": {
        "size": 15,
        "label": "Веб-инструменты",
        "text": "Веб-инструмент может содержать один или несколько инструментов, которые используются при разработке веб-сайтов, веб-ресурсов, веб-приложений и т.п."
      }
    },
    {
      "key": "4",
      "attributes": {
        "size": 15,
        "label": "Веб-ресурс",
        "text": "Веб (web (Интернет)-ресурс — информационная система, использующая web технологии на уровне представления и передачи данных, предназначенная для оказания публичных информационных услуг в сети Интернет."
      }
    },
    {
      "key": "5",
      "attributes": {
        "size": 15,
        "label": "Front-End",
        "text": "Фронтенд (англ. frontend) — презентационная часть информационной или программной системы, её пользовательский интерфейс и связанные с ним компоненты."
      }
    },
    {
      "key": "6",
      "attributes": {
        "size": 15,
        "label": "Back-End",
        "text": "Бэкенд (backend) — это, та часть работ, которая происходит за пределами досягаемости браузера, то есть на сервере. Сервер — это специальный компьютер, обычно, с наиболее большими ресурсами в отношении производительности, для реализации соответствующих задач."
      }
    },
    {
      "key": "7",
      "attributes": {
        "size": 20,
        "label": "Мобильные технологии",
        "text": "Мобильные технологии — совокупность устройств и технологий, применение которых основано на беспроводной коммуникации."
      }
    },
    {
      "key": "8",
      "attributes": {
        "size": 15,
        "label": "Гибридные приложения",
        "text": "Гибридные приложения сочетают в себе некоторые функции нативных и веб-приложений (сайт, оптимизированный под смартфон): кроссплатформенность и возможность использования ПО телефона. Такие приложения могут быть загружены через магазины приложений, и при этом имеют возможность независимого обновления информации."
      }
    },
    {
      "key": "9",
      "attributes": {
        "size": 15,
        "label": "Нативные приложения",
        "text": "Нативное приложение — это приложение, которое создается под конкретную платформу. Нативное мобильное приложение написано на «родном» для платформы языке программирования: для Android — Kotlin и Java, для Apple iOS — Objective-C и Swift."
      }
    },
    {
      "key": "10",
      "attributes": {
        "size": 15,
        "label": "Кроссплатформенность",
        "text": "Кроссплатформенность — это способность IT-продукта полноценно работать на любом устройстве вне зависимости от типа операционной системы (ОС)."
      }
    },
    {
      "key": "11",
      "attributes": {
        "size": 15,
        "label": "Дизайн-макет",
        "text": "Дизайн-макет сайта – это визуальный образ будущего сайта, разработанный с учетом технических возможностей HTML верстки."
      }
    },
    {
      "key": "12",
      "attributes": {
        "size": 15,
        "label": "HTML-макет",
        "text": "Типовые элементы вроде заголовка, навигации, контента, контактной информации надо разместить на одной странице, в совокупности это и называется её макетом. Таким образом, макет это способ организации материалов на веб-странице."
      }
    },
    {
      "key": "13",
      "attributes": {
        "size": 15,
        "label": "WebView",
        "text": "WebView – это системный компонент, или, проще говоря, приложение, которое отвечает за открытие веб-страниц в рамках других приложений."
      }
    },
    {
      "key": "14",
      "attributes": {
        "size": 15,
        "label": "HTML",
        "text": "HTML (от английского HyperText Markup Language) — это язык гипертекстовой разметки текста. Он нужен, чтобы размещать на веб-странице элементы: текст, картинки, таблицы и видео."
      }
    },
    {
      "key": "15",
      "attributes": {
        "size": 15,
        "label": "CSS",
        "text": "CSS — Cascading Style Sheets — это каскадные таблицы стилей. По сути — язык, который отвечает за описание внешнего вида HTML."
      }
    },
    {
      "key": "16",
      "attributes": {
        "size": 15,
        "label": "JavaScript",
        "text": "JavaScript – это язык программирования, который используют разработчики для создания интерактивных веб-страниц."
      }
    },
    {
      "key": "17",
      "attributes": {
        "size": 15,
        "label": "Apache Cordova",
        "text": "Apache Cordova – (или просто Cordova) это среда разработки, позволяющая создавать мобильные приложения с помощью веб-технологий: HTML, CSS, JS."
      }
    },
    {
      "key": "18",
      "attributes": {
        "size": 15,
        "label": "SPA",
        "text": "Одностраничное приложение (англ. single page application, SPA) — это веб-приложение или веб-сайт, использующий единственный HTML-документ как оболочку для всех веб-страниц и организующий взаимодействие с пользователем через динамически подгружаемые HTML, CSS, JavaScript, обычно посредством AJAX."
      }
    },
    {
      "key": "19",
      "attributes": {
        "size": 15,
        "label": "PWA",
        "text": "Прогрессивное web-приложение (англ. progressive web app, PWA) — технология в web-разработке, которая визуально и функционально трансформирует сайт в приложение (мобильное приложение в браузере)."
      }
    },
    {
      "key": "20",
      "attributes": {
        "size": 15,
        "label": "Angular",
        "text": "Angular (версия 2 и выше) — открытая и свободная платформа для разработки веб-приложений, написанная на языке TypeScript, разрабатываемая командой из компании Google, а также сообществом разработчиков из различных компаний."
      }
    },
    {
      "key": "21",
      "attributes": {
        "size": 15,
        "label": "Vue",
        "text": "Vue.js — JavaScript-фреймворк с открытым исходным кодом для создания пользовательских интерфейсов. Легко интегрируется в проекты с использованием других JavaScript-библиотек. Может функционировать как веб-фреймворк для разработки одностраничных приложений в реактивном стиле."
      }
    },
    {
      "key": "22",
      "attributes": {
        "size": 15,
        "label": "React",
        "text": "React — JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов."
      }
    },
    {
      "key": "23",
      "attributes": {
        "size": 15,
        "label": "Паттерны проектирования",
        "text": "Шаблон проектирования или паттерн (англ. design pattern) в разработке программного обеспечения — повторяемая архитектурная конструкция, представляющая собой решение проблемы проектирования в рамках некоторого часто возникающего контекста."
      }
    },
    {
      "key": "24",
      "attributes": {
        "size": 15,
        "label": "MVVM",
        "text": "MVVM — это паттерн разработки, позволяющий разделить приложение на три функциональные части: Model, View, ViewModel."
      }
    },
    {
      "key": "25",
      "attributes": {
        "size": 15,
        "label": "MVC",
        "text": "MVC расшифровывается как «модель-представление-контроллер» (от англ. model-view-controller). Это способ организации кода, который предполагает выделение блоков, отвечающих за решение разных задач. Один блок отвечает за данные приложения, другой отвечает за внешний вид, а третий контролирует работу приложения."
      }
    },
    {
      "key": "26",
      "attributes": {
        "size": 15,
        "label": "Пользовательский интерфейс",
        "text": "Пользовательский интерфейс (user interface или сокращенно UI) – это интерфейс, с помощью которого человек может управлять программным обеспечением или аппаратным оснащением."
      }
    },
    {
      "key": "27",
      "attributes": {
        "size": 15,
        "label": "Хостинг",
        "text": "Хостинг — услуга по размещению сайта или иного контента на сервере, обычно имеющем непрерывный доступ к Сети. Сайт — это в том числе набор файлов, которые нужно где-то хранить."
      }
    },
    {
      "key": "28",
      "attributes": {
        "size": 15,
        "label": "Браузер",
        "text": "Браузер, Web browser - специальная программа, предназначенная для просмотра веб-сайтов. Происходит это с помощью http запросов к серверу и получения от него данных, которые обрабатываются по специальным утвержденным стандартам и таким образом формируется веб-страница."
      }
    },
    {
      "key": "29",
      "attributes": {
        "size": 15,
        "label": "Сетевой протокол",
        "text": "Сетевой протокол — это набор правил, управляющих тем, как передаются данные между программами и, в данном контексте, между клиентом и сервером баз данных."
      }
    },
    {
      "key": "30",
      "attributes": {
        "size": 15,
        "label": "Веб-сервер",
        "text": "Веб-сервер — сервер, принимающий HTTP-запросы от клиентов, обычно веб-браузеров, и выдающий им HTTP-ответы, как правило, вместе с HTML-страницей, изображением, файлом, медиа-потоком или другими данными."
      }
    },
    {
      "key": "31",
      "attributes": {
        "size": 15,
        "label": "Клиент-серверная архитектура",
        "text": "«Клиент — сервер» (англ. client–server) — вычислительная или сетевая архитектура, в которой задания или сетевая нагрузка распределены между поставщиками услуг, называемыми серверами, и заказчиками услуг, называемыми клиентами. Фактически клиент и сервер — это программное обеспечение."
      }
    },
    {
      "key": "32",
      "attributes": {
        "size": 15,
        "label": "HTTP",
        "text": "HTTP (англ. HyperText Transfer Protocol — «протокол передачи гипертекста») — протокол прикладного уровня передачи данных, изначально — в виде гипертекстовых документов в формате HTML, в настоящее время используется для передачи произвольных данных."
      }
    },
    {
      "key": "33",
      "attributes": {
        "size": 15,
        "label": "HTTPS",
        "text": "HTTPS (аббр. от англ. HyperText Transfer Protocol Secure) — расширение протокола HTTP для поддержки шифрования в целях повышения безопасности. Данные в протоколе HTTPS передаются поверх криптографических протоколов TLS или устаревшего в 2015 году SSL. В отличие от HTTP с TCP-портом 80, для HTTPS по умолчанию используется TCP-порт 443."
      }
    },
    {
      "key": "34",
      "attributes": {
        "size": 15,
        "label": "Масштабируемость",
        "text": "Масштабируемость — способность информационной системы адаптироваться к резкому изменению показателей задач и повышению требований (например, увеличение объемов данных, числа пользователей, и т.д.). При этом речь идет не о замене оборудования и программного обеспечения, т.е. о каких-либо структурных изменениях, а о наращиваемости его производительности."
      }
    },
    {
      "key": "35",
      "attributes": {
        "size": 15,
        "label": "Реактивность",
        "text": "Реактивность значит, что при любых изменениях объектов, эти изменения сразу же будут отображаться на экране."
      }
    },
    {
      "key": "36",
      "attributes": {
        "size": 15,
        "label": "JSON",
        "text": "JSON (англ. JavaScript Object Notation) — текстовый формат обмена данными, основанный на JavaScript. Но при этом формат независим от JS и может использоваться в любом языке программирования."
      }
    },
    {
      "key": "37",
      "attributes": {
        "size": 15,
        "label": "DOM",
        "text": "Объектная Модель Документа (DOM) – это программный интерфейс (API) для HTML и XML документов. DOM предоставляет структурированное представление документа и определяет то, как эта структура может быть доступна из программ, которые могут изменять содержимое, стиль и структуру документа."
      }
    },
    {
      "key": "38",
      "attributes": {
        "size": 15,
        "label": "TypeScript",
        "text": "TypeScript (TS, TScript или «тайпскрипт») — это язык программирования для веб-разработки, основанный на JavaScript. Делает код понятнее и надежнее, добавляет статическую типизацию (переменные привязаны к конкретным типам данных), а также может быть скомпилирован в JavaScript."
      }
    },
    {
      "key": "39",
      "attributes": {
        "size": 15,
        "label": "Node.js",
        "text": "Node. js — среда выполнения кода JavaScript вне браузера, которая позволяет писать серверный код для веб-страниц и веб-приложений, а также для программ командной строки. С помощью Node. js реализуется парадигма «JavaScript для всего»."
      }
    },
    {
      "key": "40",
      "attributes": {
        "size": 15,
        "label": "Декларативность",
        "text": "Декларативное программирование — парадигма программирования, в которой задаётся спецификация решения задачи, то есть описывается ожидаемый результат, а не способ его получения. Противоположностью декларативного является императивное программирование, при котором на том или ином уровне детализации требуется описание последовательности шагов для решения задачи. В качестве примеров декларативных языков обычно приводят HTML и SQL."
      }
    },
    {
      "key": "41",
      "attributes": {
        "size": 15,
        "label": "Модульная система",
        "text": "Модульное программирование — это организация программы как совокупности небольших независимых блоков, называемых модулями. Модуль — функционально законченный фрагмент программы, оформленный в виде отдельного файла с исходным кодом."
      }
    },
    {
      "key": "42",
      "attributes": {
        "size": 15,
        "label": "База данных",
        "text": "База данных (БД) — это совокупность данных, которая включает в себя определённые правила, принципы хранения, описания и управления данными. Эти данные относятся к какой-то предметной области и позволяют решать множество конкретных задач."
      }
    },
    {
      "key": "43",
      "attributes": {
        "size": 15,
        "label": "React Native",
        "text": "React Native (также известный как RN) — это популярная платформа мобильных приложений на основе JavaScript, которая позволяет создавать мобильные приложения с собственным интерфейсом для iOS и Android. Фреймворк позволяет создавать приложения для различных платформ, используя одну и ту же кодовую базу."
      }
    },
    {
      "key": "44",
      "attributes": {
        "size": 15,
        "label": "API",
        "text": "API – Application Programming Interface, что значит программный интерфейс приложения. В контексте API слово «приложение» относится к любому ПО с определенной функцией. Интерфейс можно рассматривать как сервисный контракт между двумя приложениями."
      }
    },
    {
      "key": "45",
      "attributes": {
        "size": 15,
        "label": "Ionic",
        "text": "Ionic — это среда для разработки гибридных кроссплатформенных мобильных приложений, веб-приложений и приложений для настольных компьютеров с использованием HTML, CSS и JavaScript. Позволяет работать, используя единую базу кода."
      }
    },
    {
      "key": "46",
      "attributes": {
        "size": 15,
        "label": "Android",
        "text": "Android – операционная система, которая открыта для всех: разработчиков, дизайнеров и производителей устройств. Это означает, что возможность экспериментировать, предлагать революционные идеи и воплощать их в жизнь доступна большому количеству людей."
      }
    },
    {
      "key": "47",
      "attributes": {
        "size": 15,
        "label": "Ленивая загрузка",
        "text": "Lazy loading (ленивая загрузка) — это стратегия, направленная на определение ресурсов как неблокирующих (не критических) для того, чтобы отложить загрузку этих ресурсов на тот момент, когда они действительно необходимы."
      }
    }
  ],
  "edges": [
    {
      "key": "1",
      "source": "2",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "2",
      "source": "3",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "3",
      "source": "4",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "4",
      "source": "5",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "5",
      "source": "6",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "6",
      "source": "7",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "7",
      "source": "8",
      "target": "7",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "8",
      "source": "9",
      "target": "7",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "9",
      "source": "10",
      "target": "8",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "10",
      "source": "11",
      "target": "5",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "11",
      "source": "12",
      "target": "5",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "12",
      "source": "13",
      "target": "7",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "13",
      "source": "14",
      "target": "5",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "14",
      "source": "15",
      "target": "5",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "15",
      "source": "16",
      "target": "5",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "16",
      "source": "17",
      "target": "8",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "17",
      "source": "18",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "18",
      "source": "19",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "19",
      "source": "20",
      "target": "3",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "20",
      "source": "21",
      "target": "3",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "21",
      "source": "22",
      "target": "3",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "22",
      "source": "2",
      "target": "23",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "23",
      "source": "7",
      "target": "23",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "24",
      "source": "24",
      "target": "23",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "25",
      "source": "25",
      "target": "23",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "26",
      "source": "26",
      "target": "5",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "27",
      "source": "4",
      "target": "27",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "28",
      "source": "27",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "29",
      "source": "28",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "30",
      "source": "31",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "31",
      "source": "30",
      "target": "31",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "32",
      "source": "31",
      "target": "29",
      "attributes": {
        "size": 1,
        "label": "использует"
      }
    },
    {
      "key": "33",
      "source": "32",
      "target": "30",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "34",
      "source": "33",
      "target": "30",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "35",
      "source": "34",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "36",
      "source": "34",
      "target": "7",
      "attributes": {
        "size": 1,
        "label": "включают"
      }
    },
    {
      "key": "37",
      "source": "35",
      "target": "16",
      "attributes": {
        "size": 1,
        "label": "использует"
      }
    },
    {
      "key": "38",
      "source": "36",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "39",
      "source": "37",
      "target": "2",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "40",
      "source": "37",
      "target": "14",
      "attributes": {
        "size": 1,
        "label": "использует"
      }
    },
    {
      "key": "41",
      "source": "38",
      "target": "3",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "42",
      "source": "39",
      "target": "3",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "43",
      "source": "40",
      "target": "23",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "44",
      "source": "41",
      "target": "23",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "45",
      "source": "42",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "46",
      "source": "43",
      "target": "3",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "47",
      "source": "43",
      "target": "22",
      "attributes": {
        "size": 1,
        "label": "использует"
      }
    },
    {
      "key": "48",
      "source": "44",
      "target": "1",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "49",
      "source": "37",
      "target": "44",
      "attributes": {
        "size": 1,
        "label": "использует"
      }
    },
    {
      "key": "50",
      "source": "45",
      "target": "8",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "51",
      "source": "46",
      "target": "7",
      "attributes": {
        "size": 1,
        "label": "входит в"
      }
    },
    {
      "key": "52",
      "source": "47",
      "target": "26",
      "attributes": {
        "size": 1,
        "label": "использует"
      }
    }
  ]
}